In [78]:
import pandas as pd

In [79]:
df = pd.DataFrame({'a' : [1, 2, 3, 4],
                     'b' : [4, 5, 6, 7],
                     'c' : ['Ram', 'Manohar', 'kamarsa', 'Manu']
})

In [80]:
df

   a  b        c
0  1  4      Ram
1  2  5  Manohar
2  3  6  kamarsa
3  4  7     Manu

In [81]:
df.set_index('c') # setup column as index

         a  b
c
Ram      1  4
Manohar  2  5
kamarsa  3  6
Manu     4  7

In [82]:
df.reset_index() # revert to original index

   index  a  b        c
0      0  1  4      Ram
1      1  2  5  Manohar
2      2  3  6  kamarsa
3      3  4  7     Manu

In [83]:
df1 = pd.DataFrame({'a' : [1, 2, 3, 4],
                     'b' : [4, 5, 6, 7],
                     'c' : ['Ram', 'Manohar', 'Kamarsa', 'Manu']},
                    index = ['a', 'b', 'c', 'd']
)

In [84]:
df1

   a  b        c
a  1  4      Ram
b  2  5  Manohar
c  3  6  Kamarsa
d  4  7     Manu

In [85]:
df1.reindex([ 'c', 'd', 'b', 'a' ]) # changing the index, will change row order too

   a  b        c
c  3  6  Kamarsa
d  4  7     Manu
b  2  5  Manohar
a  1  4      Ram

In [86]:
# iteration

for i in df1.iterrows() : # row wise iteration
    print(i)

('a', a      1
b      4
c    Ram
Name: a, dtype: object)
('b', a          2
b          5
c    Manohar
Name: b, dtype: object)
('c', a          3
b          6
c    Kamarsa
Name: c, dtype: object)
('d', a       4
b       7
c    Manu
Name: d, dtype: object)

In [87]:
for i in df1.iteritems() : # column wise iteration
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a        Ram
b    Manohar
c    Kamarsa
d       Manu
Name: c, dtype: object)

/tmp/ipykernel_2926/245915590.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df1.iteritems() : # column wise iteration

In [88]:
for i in df1.itertuples() : # return named tuples and faster
    print(i)

Pandas(Index='a', a=1, b=4, c='Ram')
Pandas(Index='b', a=2, b=5, c='Manohar')
Pandas(Index='c', a=3, b=6, c='Kamarsa')
Pandas(Index='d', a=4, b=7, c='Manu')

In [89]:
df1

   a  b        c
a  1  4      Ram
b  2  5  Manohar
c  3  6  Kamarsa
d  4  7     Manu

In [90]:
# apply() will apply method only one single column

def test(x) :
    return x.sum()

df1.apply(test, axis=0)

a                       10
b                       22
c    RamManoharKamarsaManu
dtype: object

In [91]:
df2 = df1[ [ 'a', 'b' ] ]

In [92]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [93]:
# applymap() will apply method on whole dataframe

df2.applymap(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [94]:
# sorting operations

df1.sort_values('c')

   a  b        c
c  3  6  Kamarsa
b  2  5  Manohar
d  4  7     Manu
a  1  4      Ram

In [95]:
df1.sort_index()

   a  b        c
a  1  4      Ram
b  2  5  Manohar
c  3  6  Kamarsa
d  4  7     Manu

In [96]:
df1.sort_index(ascending=False)

   a  b        c
d  4  7     Manu
c  3  6  Kamarsa
b  2  5  Manohar
a  1  4      Ram

In [108]:
pd.set_option('display.max_colwidth', 1000) # setting the display size of the column_width

df3 = pd.DataFrame({ 'desc' : ["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.", "This is Ram", "Python_Full_Stack_Dev", "Data_Science"] })

In [109]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    This is Ram
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          Python_Full_Stack_Dev
3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   Data_Science

In [111]:
df3['char_ln_data'] = df3['desc'].apply(len)

In [112]:
df3

,desc,char_ln_data
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,This is Ram,11
2,Python_Full_Stack_Dev,21
3,Data_Science,12

In [114]:
df3['no_of_words'] = df3['desc'].apply(lambda x : len(x.split()))

In [115]:
df3

,desc,char_ln_data,no_of_words
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765,104
1,This is Ram,11,3
2,Python_Full_Stack_Dev,21,1
3,Data_Science,12,1